nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa276/common/pin_mux/pin_mux.c
    gpio_pin_config_t gpio2_pin60_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_25 (pin 60)  */
    GPIO_PinInit(GPIO2, 25U, &gpio2_pin60_config);

    gpio_pin_config_t gpio3_pin88_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin 88)  */
    GPIO_PinInit(GPIO3, 16U, &gpio3_pin88_config);

    gpio_pin_config_t gpio4_pin22_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_1 (pin 22)  */
    GPIO_PinInit(GPIO4, 1U, &gpio4_pin22_config);

    gpio_pin_config_t gpio4_pin24_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin 24)  */
    GPIO_PinInit(GPIO4, 3U, &gpio4_pin24_config);

    PORT0->PCR[7] = ((PORT0->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT0_7 (pin 116) is configured as FLEXIO0_D7. */
                     | PORT_PCR_MUX(PORT0_PCR7_MUX_mux110)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_15 (pin 8) is configured as FLEXIO0_D23 */
    PORT_SetPinMux(PORT1, 15U, kPORT_MuxAlt6);

    PORT1->PCR[15] = ((PORT1->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_19 (pin 12) is configured as FLEXIO0_D27 */
    PORT_SetPinMux(PORT1, 19U, kPORT_MuxAlt6);

    PORT1->PCR[19] = ((PORT1->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[10] = ((PORT2->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_10 (pin 43) is configured as FLEXIO0_D18. */
                      | PORT_PCR_MUX(PORT2_PCR10_MUX_mux110)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[11] = ((PORT2->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_11 (pin 44) is configured as FLEXIO0_D19. */
                      | PORT_PCR_MUX(PORT2_PCR11_MUX_mux110)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[14] = ((PORT2->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_14 (pin 49) is configured as FLEXIO0_D22. */
                      | PORT_PCR_MUX(PORT2_PCR14_MUX_mux110)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[18] = ((PORT2->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_18 (pin 53) is configured as FLEXIO0_D26. */
                      | PORT_PCR_MUX(PORT2_PCR18_MUX_mux110)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[22] = ((PORT2->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_22 (pin 57) is configured as FLEXIO0_D30. */
                      | PORT_PCR_MUX(PORT2_PCR22_MUX_mux110)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[24] = ((PORT2->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_24 (pin 59) is configured as P2_24. */
                      | PORT_PCR_MUX(PORT2_PCR24_MUX_mux00)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[25] = ((PORT2->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                      /* Pin Multiplex Control: PORT2_25 (pin 60) is configured as P2_25. */
                      | PORT_PCR_MUX(PORT2_PCR25_MUX_mux00)

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[8] = ((PORT2->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_8 (pin 41) is configured as FLEXIO0_D16. */
                     | PORT_PCR_MUX(PORT2_PCR8_MUX_mux110)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT2->PCR[9] = ((PORT2->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_9 (pin 42) is configured as FLEXIO0_D17. */
                     | PORT_PCR_MUX(PORT2_PCR9_MUX_mux110)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin 92) is configured as FLEXIO0_D20 */
    PORT_SetPinMux(PORT3, 12U, kPORT_MuxAlt6);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin 91) is configured as FLEXIO0_D21 */
    PORT_SetPinMux(PORT3, 13U, kPORT_MuxAlt6);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

